[
  {
    "category": "company news",
    "datetime": 1583761751,
    "headline": "Stock market trading suspended as AAPL and others hit 7% trigger - 9to5Mac",
    "id": 1006521,
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/AAPL-trigger.jpg?quality=82&strip=all",
    "related": "AAPL",
    "source": "9to5Mac",
    "summary": "Trading in US stocks has been suspended as AAPL and other shares hit a 7% trigger. As we explained earlier, the automatic suspensions are designed to limit panic reactions … ‘Circuit breakers’ designed to protect against panic-selling are likely to kick in today. With U.S. stocks set to plunge at the open, investors will be …",
    "url": "https://9to5mac.com/2020/03/09/stock-market-trading-suspended/"
  },
  {
    "category": "company news",
    "datetime": 1583760071,
    "headline": "Deals: Get the New 128GB MacBook Air for $849.99 ($250 Off, Lowest Ever Price)",
    "id": 1006522,
    "image": "https://images.macrumors.com/article-new/2013/09/macbook_air_trio_transparent.png",
    "related": "AAPL",
    "source": "Mac Rumors",
    "summary": "Amazon, Adorama, and Best Buy have a few solid deals on the newest MacBook Air and MacBook Pro models this week. The highlight of the sale is new lowest-ever prices on both storage capacities of the 2019 MacBook Air, which can be found at Best Buy. Note: MacRumors is an affiliate partner with these vendors. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running. You can get the 128GB MacBook Air in Gold for $849.99 , down from $1,099.00, and the 256GB in Gold for $1,049.99 , down from $1,299.00. Both of these sales offer $250 off the regular price of the 2019 13-inch MacBook Air, and are the newest low prices on these notebooks. If you're okay with an older model, Best Buy also has the 128GB 2017 MacBook Air for $699.99 ($300 off) for My Best Buy members. At Amazon and Adorama you'll find deals on the 16-inch MacBook Pro. While the 1TB model has been consistently on sale with a low price of $2,499.00 the past few weeks ($300 off), the 512GB model hasn't returned to a lowest-ever price in a while.",
    "url": "https://www.macrumors.com/2020/03/09/deals-128gb-macbook-air-2/"
  },
  {
    "category": "company news",
    "datetime": 1583759551,
    "headline": "Apple reportedly sold less than 500,000 iPhones in China last month as coronavirus hit the smartphone market",
    "id": 1006523,
    "image": "https://i.insider.com/5e6637e9fee23d3eca603c65?width=1200&format=jpeg",
    "related": "AAPL",
    "source": "Business Insider",
    "summary": "Chinese government stats say Apple only sold 494,000 iPhones in China in February, per Reuters . According to the statistics, the smartphone market took an overall hit of 54.7% compared to February last year. Apple warned last month that it wouldn't meet revenue guidance for the March quarter due to the coronavirus outbreak. Visit Business Insider's homepage for more stories . Apple's business in China took a big hit in February according to Chinese government stats, Reuters reports. Figures given out by the China Academy of Information and Communications Technology say that shipments of the iPhone fell to 494,000 in February compared to 1.27 million in February 2019. Apple was not immediately available for comment on the figures when contacted by Business Insider. Apple is far from the only smartphone maker whose Chinese sales have suffered during the coronavirus outbreak. The government figures showed an overall drop in the smartphone market of 54.7% from February last year — from 14 million to 6.34 million.",
    "url": "https://www.businessinsider.com/apple-reportedly-sells-less-than-500000-iphones-china-february-2020-3"
  },
  {
    "category": "company news",
    "datetime": 1583758365,
    "headline": "iPhone 12 release and iPhone 9 reportedly delayed due to coronavirus",
    "id": 1006524,
    "image": "https://boygeniusreport.files.wordpress.com/2020/03/iphone-12-cc-1.jpg?quality=98&strip=all",
    "related": "AAPL",
    "source": "BGR.com",
    "summary": "Apple's iPhone 12 series will feature the first big iPhone redesign in three years, and it's the most hotly anticipated smartphone release of 2020. Four new iPhone 12 models are expected to debut this coming September and a fifth new iPhone model — the iPhone 9 — is believed to be ready for a reveal even sooner, perhaps as early as the end of March. According to multiple reports, the novel coronavirus outbreak will delay Apple's iPhone 12 release as well as the iPhone 9 release, which was expected in early April. Visit BGR's homepage for more stories . Apple's planned iPhone 12 release is still more than six months away, but the upcoming new iPhone series is already the most talked-about phone series in the world right now. iPhones always get tons of buzz each and every year, of course, but the iPhone 12's early hype is particularly interesting because 2020 should be a year that people are more focused on Android phones. After a couple of years where Android smartphones got a bit dull, this year we're seeing nifty new designs become more popular.",
    "url": "https://bgr.com/2020/03/09/iphone-12-release-date-delayed-iphone-9-delayed-too/"
  },
  {
    "category": "company news",
    "datetime": 1583758260,
    "headline": "AAPL is down 7% in pre-market trading as stock market slumps - 9to5Mac",
    "id": 1006525,
    "image": "https://9to5mac.com/wp-content/uploads/sites/6/2020/03/AAPL-is-down-in-stock-market-slump.jpg?quality=82&strip=all",
    "related": "AAPL",
    "source": "9to5Mac",
    "summary": "AAPL is down more than 7% in pre-market trading, but it's nothing to do with the company: it's part of a slump across the stock market caused by two …",
    "url": "https://9to5mac.com/2020/03/09/aapl-is-down/"
  },
  {
    "category": "company news",
    "datetime": 1583756729,
    "headline": "Powerbeats4 just leaked – get $200 Powerbeats3 on sale for $70 instead",
    "id": 1006526,
    "image": "https://boygeniusreport.files.wordpress.com/2016/12/powerbeats3.jpg?quality=98&strip=all",
    "related": "AAPL",
    "source": "BGR.com",
    "summary": "Apple is widely believed to be prepping new Powerbeats4 wireless earbuds for release, and now a German blog called WinFuture has published leaked photos and specs for the upcoming next-generation earbuds. The new model will feature a slightly updated design compared to Apple's current-generation Powerbeats 3 earphones, as well as slightly improved battery life and \"Hey Siri\" support. No other major changes are expected. Given the inevitable $200 price tag, Amazon's current deal that slashes Powerbeats3 wireless earphones to just $69.99 is a much smarter buy. Visit BGR's homepage for more stories . It's not exactly a mystery that Apple is working on next-generation Powerbeats earbuds to replace the popular Powerbeats3 model that was first released back in 2016. Dubbed Powerbeats4, the new version has long been expected to feature a few key updates, including a tweaked design and Apple's H1 chip. Nothing too exciting, but just enough of a refresh to pique people's interest. Now, images of the new Powerbeats4 wireless earphones have been posted by WinFuture along with specs and key details.",
    "url": "https://bgr.com/2020/03/09/powerbeats4-leaked-images-specs-vs-powerbeats3/"
  },
  {
    "category": "company news",
    "datetime": 1583755212,
    "headline": "Galaxy S20 phones aren’t as good as iPhone 11 Pro in durability tests",
    "id": 1006527,
    "image": "https://boygeniusreport.files.wordpress.com/2020/03/galaxy-s20-s20-plus-s20-ultra-droptest-squaretrade.jpg?quality=98&strip=all",
    "related": "AAPL",
    "source": "BGR.com",
    "summary": "The new Galaxy S20 phones are made of glass, like many other smartphone flagships, iPhone 11 series included. SquareTrade durability test shows that the Galaxy S20 isn’t more durable than the iPhone 11 series, and you’ll definitely need a protective case. Apple’s glass-sandwich was able to survive a tumble test , while the Galaxy S20’s glass cracked in all tests. Visit BGR’s homepage for more stories . The Galaxy S20 series started selling in stores on Friday, which means you can test it out in person before deciding to spend north of $1,000 for one of the three models. But when you do pull the trigger, be ready to invest in protective gear, including a decent case and a screen protector — the phone comes with a screen protector pre-installed. That’s because the S20, S20+, and S20 Ultra are all susceptible to glass damage following accidental drops and tumbles. We saw a Galaxy S20 Ultra drop test a few days ago which revealed that both the screen and the rear glass panels will crack when dropped on concrete from around three feet.",
    "url": "https://bgr.com/2020/03/09/galaxy-s20-ultra-drop-test-vs-iphone-11-pro-youll-need-protection/"
  },
  {
    "category": "company news",
    "datetime": 1583755136,
    "headline": "Powerbeats4 Leaked, Expected to Feature H1 Chip With 'Hey Siri' Support and More",
    "id": 1006528,
    "image": "https://images.macrumors.com/article-new/2020/03/powerbeats4-leak.png",
    "related": "AAPL",
    "source": "Mac Rumors",
    "summary": "German blog WinFuture.de today shared what it claims are \"official\" marketing photos of the rumored Powerbeats4 earphones, which will apparently be offered in white, black, and red color options. In line with Apple's recent FCC filing , the Powerbeats4 are expected to have a more curved design that is similar to the ‌Powerbeats Pro‌, with the same angled in-ear fit and wraparound earhooks. Like the Powerbeats3, however, the Powerbeats4 will continue to have wires that run down from the bottom of each earhook. As expected, the report claims the Powerbeats4 will be equipped with the same Apple-designed H1 chip as the Powerbeats Pro, which should result in hands-free \"Hey Siri\" support, longer talk time and up to a 1.5x faster connection time for phone calls, up to 30 percent lower gaming latency, and more. Apple already released totally wireless Powerbeats Pro with \"Hey Siri\" support last year for $249. Powerbeats3 are priced at $199. Apple received FCC approval for new Powerbeats last month, and that usually signals an upcoming release, so Powerbeats4 could be announced any day now with a press release.",
    "url": "https://www.macrumors.com/2020/03/09/powerbeats4-images-leaked/"
  },
  {
    "category": "company news",
    "datetime": 1583754529,
    "headline": "iPad Air Users Report Blank Screen Issue, Apple to Fix It For Free",
    "id": 1006529,
    "image": "https://images.assettype.com/thequint/2020-03/741e20c0-84a6-4005-825d-eb6e90a79bfc/pic_ipad_pro_hero.jpg",
    "related": "AAPL",
    "source": "The Quint",
    "summary": "To take advantage of the offer, one can can take their tablet to an Apple Authorized Service Provider or an Apple Store, a user can also contact Apple Support if you want to mail it in.",
    "url": "https://www.thequint.com/tech-and-auto/tech-news/apple-fix-ipad-air-screen-issue-free-if-bought-during-this-time"
  },
  {
    "category": "company news",
    "datetime": 1583753300,
    "headline": "Apple Sold 60 Percent Fewer iPhones in China Last Month Compared to February 2019 Amid Coronavirus Restrictions",
    "id": 1006530,
    "image": "https://images.macrumors.com/article-new/2019/09/newiphonesno3dtouch.jpg",
    "related": "AAPL",
    "source": "Mac Rumors",
    "summary": "Apple sold fewer than 500,000 iPhones in China last month amid the ongoing curbs on travel and transport, according to government data shared on Monday (via Reuters ). Shipments of Apple devices slumped to 494,000, from 1.27 million in February 2019. In January, their shipments had held steady at just over 2 million. That amounts to an almost 60 percent slump in iPhone sales – worse than IDC's forecasted drop in overall smartphone sales of roughly 40 percent in the first quarter due to the impact of coronavirus. China's restrictions on public movement were enforced in late January just ahead of the Lunar New Year Festival and remained in place throughout most of February, which appears to have crippled demand for smartphones. According to data from the China Academy of Information and Communications Technology, mobile phone brands shipped a total of 6.34 million devices in February, down 55 percent from 14 million sold in February 2019. Android brands like Huawei and Xiaomi suffered the worst, with shipments collectively declining from 12.72 million units in February 2019 to 5.85 million.",
    "url": "https://www.macrumors.com/2020/03/09/apple-sold-less-than-500000-iphones-china-feb/"
  },
  {
    "category": "company news",
    "datetime": 1583752170,
    "headline": "Apple sells fewer than 500,000 iPhones in China in February amid coronavirus",
    "id": 1006531,
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2020/03/09/6fe93cce-61f3-11ea-8e9f-2d196083a37c_image_hires_202022.jpg?itok=3gTagzpl&v=1583756428",
    "related": "AAPL",
    "source": "South China Morning Post",
    "summary": "Apple sold fewer than half a million iPhones in China in February, government data showed on Monday, as the coronavirus outbreak crippled demand in the world’s largest smartphone market.China placed curbs on travel and asked residents to avoid public places in late January, just ahead of the Lunar New Year festival, a major gift-giving holiday. Those restrictions stayed largely in place through most of February.Smartphone brands shipped a total of 6.34 million devices that month, down 54.7 per…",
    "url": "https://www.scmp.com/tech/gear/article/3074323/apple-sells-fewer-500000-iphones-china-february-amid-coronavirus"
  },
  {
    "category": "company news",
    "datetime": 1583748919,
    "headline": "Apple will fix your iPad Air for free if it has this issue",
    "id": 1006532,
    "image": "https://images.financialexpress.com/2020/03/ipad-air-660.jpg",
    "related": "AAPL",
    "source": "The Financial Express",
    "summary": "Apple has announced a 'free' service program for the third-generation or 2019 iPad Air that are affected by the so-called 'blank screen' issue.",
    "url": "https://www.financialexpress.com/industry/technology/apple-will-fix-your-ipad-air-for-free-if-it-has-this-issue/1893293/"
  },
  {
    "category": "company news",
    "datetime": 1583748001,
    "headline": "Top 5 Apple iPhone SE 2 rumors video - CNET",
    "id": 1006533,
    "image": "https://cnet4.cbsistatic.com/img/OAIwQjVEOGVYegmbMCj1I9pEWps=/2020/03/06/edfca964-fc4e-4d7e-8c92-47a6f7bfbc97/top5-iphonese2-rumors-00-03-52-17-still002.png",
    "related": "AAPL",
    "source": "CNET",
    "summary": "Reports are coming in left and right about a sequel to Apple's mini phone. The next generation could be bigger than the original. Literally.",
    "url": "https://www.cnet.com/videos/top-5-apple-iphone-se-2-rumors/"
  },
  {
    "category": "company news",
    "datetime": 1583747285,
    "headline": "Apple will fix blank screen issue on iPad Air tablets. See if you are eligible",
    "id": 1006534,
    "image": "https://www.thestatesman.com/wp-content/uploads/2020/03/iStock-465520964_ED.jpg",
    "related": "AAPL",
    "source": "The Statesman",
    "summary": "Apple has announced a new repair program for iPad Air, giving a sigh of relief to all third-gen device users who were wondering how they were going to fix",
    "url": "https://www.thestatesman.com/technology/apple-will-fix-blank-screen-issue-ipad-air-tablets-see-eligible-1502864267.html"
  },
  {
    "category": "company news",
    "datetime": 1583746464,
    "headline": "DigiTimes: Travel Restrictions Delaying iPhone 12 Verification Tests",
    "id": 1006535,
    "image": "https://images.macrumors.com/article-new/2019/12/fouriphones2020.jpg",
    "related": "AAPL",
    "source": "Mac Rumors",
    "summary": "Apple's ban on its engineers from traveling to Asia in the wake of the coronavirus has affected the development of its next-generation iPhone , claims a new report today from DigiTimes . According to the supply chain-focused Taiwanese publication, the travel restrictions have delayed the engineering verification test for the 5G iPhones at manufacturing facilities in China. The claim follows a Bloomberg article published over the weekend that quotes a report from Bank of America analysts suggesting Apple's 5G iPhone release could be delayed by a month this fall. Apple has reportedly restricted employee travel to several countries hit by the coronavirus outbreak, including China, which is an issue because Apple engineers often visit China at this time of year to prepare for the manufacturing of new iPhones. Production of new devices usually kicks off in the summer, but during the first months of the year, Apple employees visit China to perfect assembly processes with manufacturing partners like Foxconn.",
    "url": "https://www.macrumors.com/2020/03/09/iphone-12-fall-launch-delay-travel-restrictions/"
  },
  {
    "category": "company news",
    "datetime": 1583744734,
    "headline": "Apple's major AirPods manufacturer resumes production in China",
    "id": 1006536,
    "image": "https://photo-cdn.urdupoint.com/media/2020/03/_3/730x425/pic_1583744734.jpg",
    "related": "AAPL",
    "source": "UrduPoint",
    "summary": "No summary available.",
    "url": "https://www.urdupoint.com/en/technology/apples-major-airpods-manufacturer-resumes-pr-858833.html"
  },
  {
    "category": "company news",
    "datetime": 1583743908,
    "headline": "Apple Watch Blood Oxygen Monitoring Feature Found in iOS 14 Code",
    "id": 1006537,
    "image": "https://images.macrumors.com/article-new/2014/09/applewatchheartratesensor.jpg",
    "related": "AAPL",
    "source": "Mac Rumors",
    "summary": "Apple is working on a new Apple Watch feature that detects blood oxygen levels, according to newly discovered code snippets in iOS 14 (via 9to5Mac ). Blood oxygen saturation naturally fluctuates throughout the day, but large variations can be linked to health issues. For example, 95-100 percent oxygen in the blood is considered normal, but a drop below that percentage could be a sign of a serious respiratory or cardiac problem. At the center of Apple's new feature is a new health notification based on blood oxygen levels – when ‌Apple Watch‌ blood oxygen saturation drops below a certain threshold, the wearer is alerted, just like existing heart rate notifications. Apple holds patents for blood oxygen monitoring, and early prototypes of the first ‌Apple Watch‌ featured sensors that measured blood oxygen monitoring among other biometrics, but many of these functions never made it into the final product because of consistency issues . When the original ‌‌Apple Watch‌‌ was released back in 2015, iFixit actually discovered that Apple's heart sensors have the capability to monitor blood oxygen levels, but Apple has never activated it.",
    "url": "https://www.macrumors.com/2020/03/09/apple-watch-blood-oxygen-monitoring/"
  },
  {
    "category": "company news",
    "datetime": 1583741038,
    "headline": "You can unlock iPhone Face ID with a mask on, Tencent says",
    "id": 1006538,
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/2020/03/09/img_5839.jpg?itok=_UKriUQM",
    "related": "AAPL",
    "source": "South China Morning Post",
    "summary": "This article originally appeared on ABACUSWith many people wearing face masks everywhere they go during the coronavirus epidemic, iPhone users without Touch ID have to manually put in their pin number dozens of times every day to unlock their phones. Now there’s a possible solution. Tencent Security Xuanwu Lab published a tutorial on how to use Apple's Face ID with a face mask on. The tutorial shows that users can set up a new Face ID while holding a folded mask that covers the right or left…",
    "url": "https://www.scmp.com/tech/article/3074265/you-can-unlock-iphone-face-id-mask-tencent-says"
  },
  {
    "category": "company news",
    "datetime": 1583730790,
    "headline": "Tech News Update: Samsung Galaxy M21 India launch, Apple’s fix for faulty iPad Air (2019) models",
    "id": 1006539,
    "image": "https://images.indianexpress.com/2020/03/apple_iphone11_iphone11pro-759-1.jpg?w=759",
    "related": "AAPL",
    "source": "The Indian Express",
    "summary": "Tech News Update: Apple has launched a service programme for the third generation iPad Air (2019) models affected by a “Blank Screen” issue. The repair is free of cost. Separately, Samsung is expected to launch Galaxy M31 in India next week. Read for details.",
    "url": "https://indianexpress.com/article/technology/tech-news-technology/tech-news-live-updates-latest-apple-redmi-samsungnews-6306200/"
  },
  {
    "category": "company news",
    "datetime": 1583729044,
    "headline": "Apple Watch is about to get a revolutionary new health feature that could save your life",
    "id": 1006540,
    "image": "https://boygeniusreport.files.wordpress.com/2019/12/apple-watch-series-5-stock.jpg?quality=98&strip=all",
    "related": "AAPL",
    "source": "BGR.com",
    "summary": "Thanks to a combination of hardware and software, Apple Watch has evolved over the years into a powerful health and wellness tool for millions of users. Soon, at least one new and potentially life-saving capability will be added to its feature set: The ability to analyze blood-oxygen levels, according to a new report. That's important, because low blood-oxygen levels could signal an impending health emergency. Visit BGR’s homepage for more stories . There have been countless stories over the past couple of years about how Apple Watch saves lives, thanks in part to the watch's heart rate monitor that can spot life-threatening health conditions early. That's one reason some insurance companies have decided to just go ahead and subsidize the cost of an Apple Watch for its members. Meantime, a new report has shed some light on even more health features along these lines that are coming to the watch soon -- and stand to make it an even more powerful complement to users' overall wellness regimens.",
    "url": "https://bgr.com/2020/03/09/apple-watch-blood-oxygen-level-ecg/"
  }
]
